mgo-tec/ESP32_SPIFFS_EasyWebSocket/src/ESP32_SPIFFS_EasyWebSocket.cpp
  return false;
}
//********hand shake time out *****************
void ESP32_SPIFFS_EasyWebSocket::HandShake_timeout(uint8_t Num){
  _WS_on = 0;
  _Ini_html_on = 0;
  _Upgrade_first_on = false;
  Serial.print(F("-------Received TimeOut "));
  Serial.println(Num);
  if(__client){
    __client.flush();
    delay(10);
    __client.stop();
    delay(10);
    Serial.print(F("-------TimeOut Client Stop "));
    Serial.println(Num);
  }
  Serial.print(F("-------The Handshake returns to the beginning "));
  Serial.println(Num);
}
//********WebSocket Hand Shake ****************
void ESP32_SPIFFS_EasyWebSocket::EWS_HandShake_main(uint8_t sel, const char* head_file1, const char* head_file2, const char* html_file1, const char* html_file2, IPAddress res_LIP, String res_html1, String res_html2, String res_html3, String res_html4, String res_html5, String res_html6, String res_html7){
  String req;
  String hash_req_key;
  _GetLoopTime = millis();

  while(__client){

    if( ESP32_SPIFFS_EasyWebSocket::http_resp() ) break;

    File HTML_head_F1, HTML_head_F2, HTML_1, HTML_2;

    HTML_head_F1 = ESP32_SPIFFS_EasyWebSocket::SPIFFS_open(head_file1);
    if(HTML_head_F1 == 0) return;

    if(sel >= 2){
      HTML_head_F2 = ESP32_SPIFFS_EasyWebSocket::SPIFFS_open(head_file2);
      if(HTML_head_F2 == 0) return;
    }
    if(sel >= 1 && sel <= 3){
      HTML_1 = ESP32_SPIFFS_EasyWebSocket::SPIFFS_open(html_file1);
      if(HTML_1 == 0) return;
      HTML_2 = ESP32_SPIFFS_EasyWebSocket::SPIFFS_open(html_file2);
      if(HTML_2 == 0) return;
    }

    ESP32_SPIFFS_EasyWebSocket::SPIFFS_Client_Write( HTML_head_F1, head_file1 );

    if(sel >= 2){
      __client.print(res_LIP);
      ESP32_SPIFFS_EasyWebSocket::SPIFFS_Client_Write( HTML_head_F2, head_file2 );
    }
    if(sel >= 1 && sel <= 3){
      ESP32_SPIFFS_EasyWebSocket::SPIFFS_Client_Write( HTML_1, html_file1 );
    }

    __client.print(res_html1);
    __client.print(res_html2);
    __client.print(res_html3);
    if(sel == 0 || sel >= 3){
      __client.print(res_html4);
      __client.print(res_html5);
      __client.print(res_html6);
      __client.print(res_html7);
    }
    if(sel >= 1 && sel <= 3){
      ESP32_SPIFFS_EasyWebSocket::SPIFFS_Client_Write( HTML_2, html_file2 );
      HTML_1.close();
      HTML_2.close();
    }
    if(sel >= 2){
      HTML_head_F2.close();
    }

    HTML_head_F1.close();

    res_html1 = "";
    res_html2 = "";
    res_html3 = "";
    res_html4 = "";
    res_html5 = "";
    res_html6 = "";
    res_html7 = "";

    Serial.println(F("---------------------HTTP response complete"));

    __client.flush();
    delay(10);
    __client.stop();
    delay(10);

    Serial.println(F("\n-------GET HTTP client stop"));
    req = "";
    _Ini_html_on = 1;
    _GetLoopTime = millis();

    if(_Android_or_iPad == 'i'){
      break;
    }
    break;
  }
}
//********Client write from SD*********************
void ESP32_SPIFFS_EasyWebSocket::SPIFFS_Client_Write(File SPIFFS_File, const char* file_name){
  if (SPIFFS_File == 0) {
    Serial.printf("%s File not found\n",file_name);
    return;
  }else{
    Serial.printf("%s File found. OK!\n",file_name);

    //size_t totalSize = SPIFFS_File.size();
    char c = 0x20;
    char c_print_buff[256];
    uint16_t index_count = 0;

    if(__client){    
      while(c!='\0'){
        c= SPIFFS_File.read();
        c_print_buff[index_count] = c;
        if(c>0xEF) break;
        index_count++;
        if (index_count == 256){
          __client.write((const char*)c_print_buff, 256);     
          Serial.print('.');
          index_count = 0;
        }
        delay(1);
      }
    }

    if (index_count > 0){
      __client.write((const char*)c_print_buff, index_count);
      index_count = 0;
    }
    Serial.println();
  }
}
//********Hand Shake Main *********************
File ESP32_SPIFFS_EasyWebSocket::SPIFFS_open(const char *filename){
  File f = SPIFFS.open(filename, FILE_READ);
  if (f == 0) {
    Serial.printf("%s File not found. Cannot opened.\n", filename);
    __client.print(F("ERROR!!<br>"));
    __client.print(filename);
    __client.print(F(" file has not been uploaded to the flash in SD card<br>"));
  }else{
    Serial.printf("%s File Open. OK!\n", filename);
  }
  return f;
}

//********WebSocket Hand Shake ****************
void ESP32_SPIFFS_EasyWebSocket::EWS_HandShake(const char* HTML_file, String res_html1, String res_html2, String res_html3, String res_html4, String res_html5, String res_html6, String res_html7)
{
  bool req_status = ESP32_SPIFFS_EasyWebSocket::Get_Http_Req_Status();

  if(req_status == true){
    ESP32_SPIFFS_EasyWebSocket::EWS_HandShake_main(0, HTML_file, "", "", "", IPAddress(0,0,0,0), res_html1, res_html2, res_html3, res_html4, res_html5, res_html6, res_html7);
  }
}

//********WebSocket Hand Shake (for devided HTML files)****************
void ESP32_SPIFFS_EasyWebSocket::EWS_Dev_HandShake(const char* HTML_head_file, const char* HTML_file1, String res_html1, String res_html2, String res_html3, const char* HTML_file2)
{
  bool req_status = ESP32_SPIFFS_EasyWebSocket::Get_Http_Req_Status();

  if(req_status == true){
    ESP32_SPIFFS_EasyWebSocket::EWS_HandShake_main(1, HTML_head_file, "", HTML_file1, HTML_file2, IPAddress(0,0,0,0), res_html1, res_html2, res_html3, "", "", "", "");
  }
}
//********WebSocket Hand Shake (for devided HTML header files & Auto Local IP address)****************
void ESP32_SPIFFS_EasyWebSocket::EWS_Dev_AutoLIP_HandShake(const char* HTML_head_file1, IPAddress res_LIP, const char* HTML_head_file2, const char* HTML_file1, String res_html1, String res_html2, String res_html3, String res_html4, String res_html5, String res_html6, String res_html7, const char* HTML_file2)
{
  bool req_status = ESP32_SPIFFS_EasyWebSocket::Get_Http_Req_Status();

  if(req_status == true){
    ESP32_SPIFFS_EasyWebSocket::EWS_HandShake_main(3, HTML_head_file1, HTML_head_file2, HTML_file1, HTML_file2, res_LIP, res_html1, res_html2, res_html3, res_html4, res_html5, res_html6, res_html7);
  }
}
//************HTTP Response**************************
void ESP32_SPIFFS_EasyWebSocket::EWS_HTTP_Responce()
{  
  String req;
  String hash_req_key;
  uint32_t LoopTime = millis();

  if(_Upgrade_first_on != true){
    handleClient();
  }

