mgo-tec/ESP32_SPIFFS_EasyWebSocket/src/ESP32_SPIFFS_EasyWebSocket.cpp
String ESP32_SPIFFS_EasyWebSocket::EWS_BrowserSendRate()
{
  String str;
  str += "<form name='fRate'>\r\n";
  str += "  <select id='selRate'>\r\n";
  str += "    <option value=0>0ms</option>\r\n";
  str += "    <option value=5>5ms</option>\r\n";
  str += "    <option value=10>10ms</option>\r\n";
  str += "    <option value=15>15ms</option>\r\n";
  str += "    <option value=20>20ms</option>\r\n";
  str += "    <option value=25>25ms</option>\r\n";
  str += "    <option value=30>30ms</option>\r\n";
  str += "    <option value=35>35ms</option>\r\n";
  str += "    <option value=40>40ms</option>\r\n";
  str += "    <option value=45>45ms</option>\r\n";
  str += "    <option value=50>50ms</option>\r\n";
  str += "  </select>\r\n";
  str += "  <input type='button' value='Rate Exec' onclick='onButtonRate();' />\r\n";
  str += "  Browser Transfer Rate= <span id='RateTxt'>0</span>ms\r\n";
  str += "</form>\r\n";
  return str;
}

String ESP32_SPIFFS_EasyWebSocket::EWS_ESP32_SendRate(String button_id)
{    
  String str;
  str += "<form name='F_esp32SR'>\r\n";
  str += "  <select id='sel_esp32SR'>\r\n";
  str += "    <option value=0>0ms</option>\r\n";
  str += "    <option value=25>25ms</option>\r\n";
  str += "    <option value=50>50ms</option>\r\n";
  str += "    <option value=75>75ms</option>\r\n";
  str += "    <option value=100>100ms</option>\r\n";
  str += "    <option value=150>150ms</option>\r\n";
  str += "    <option value=200>200ms</option>\r\n";
  str += "    <option value=250>250ms</option>\r\n";
  str += "    <option value=300>300ms</option>\r\n";
  str += "    <option value=500>500ms</option>\r\n";
  str += "    <option value=999>999ms</option>\r\n";
  str += "  </select>\r\n";
  str += "  <input type='button' value='Rate Exec' onclick='doSend(document.F_esp32SR.sel_esp32SR.value,\"";
  str += button_id;
  str += "\"); document.getElementById(\"esp32send_RateTxt\").innerHTML=document.F_esp32SR.sel_esp32SR.value;'>\r\n";
  str += "  ESP32 Transfer Rate= <span id='esp32send_RateTxt'>0</span>ms\r\n";
  str += "</form>\r\n";
  return str;
}

String ESP32_SPIFFS_EasyWebSocket::EWS_Status_Text2(String name, String b_color, uint8_t font_size, String f_color)
{
  String str;
  str = "<fieldset style='border-style: solid; border-color:";
	str += b_color;
	str += ";'>\r\n";
  str += "<legend style='font-style: italic; color:";
	str += b_color;
	str += ";'>\r\n";
  str += name;
  str += "</legend><span id='__wsStatus__' style='font-size:";
  str += String(font_size);
  str += "px; color:";
  str += f_color;
  str += ";' ></span></fieldset>\r\n";
  return str;
}

String ESP32_SPIFFS_EasyWebSocket::EWS_Canvas_Slider_T(String slider_id, uint16_t width, uint16_t height, String frame_col, String fill_col)
{
  String str;
  str = "<canvas id='" + slider_id + "' width='" + String(width) + "' height='" + String(height) + "'></canvas>\r\n";
  
  str += "<script type='text/javascript'>\r\n";
  str += "  fnc_" + slider_id + "();\r\n";
  str += "  function fnc_" + slider_id + "(){\r\n";
  str += "    var c_w = " + String(width) + ";\r\n";
  str += "    var c_h = " + String(height) + ";\r\n";
  str += "    var line_width = 5;\r\n";
  str += "    var canvas2 = document.getElementById('" + slider_id + "');\r\n";
  str += "    var ctx2 = canvas2.getContext('2d');\r\n";
  str += "    ctx2.clearRect(0, 0, c_w, c_h);\r\n";
  str += "    ctx2.beginPath();\r\n";
  str += "    ctx2.lineWidth = line_width;\r\n";
  str += "    ctx2.strokeStyle = '" + frame_col + "';\r\n";
  str += "    ctx2.strokeRect(0,0,c_w,c_h);\r\n";

  str += "    canvas2.addEventListener('touchmove', slider_" + slider_id + ", false);\r\n";
  str += "    canvas2.addEventListener('touchstart', slider_" + slider_id + ", false);\r\n";
  
  str += "    function slider_" + slider_id + "(event3) {\r\n";
  str += "      event3.preventDefault();\r\n";
  str += "      event3.stopPropagation();\r\n";
  str += "      var evt555=event3.touches[0];\r\n";
  str += "      var OffSet2 = evt555.target.getBoundingClientRect();\r\n";
  str += "      var ex = evt555.clientX - OffSet2.left;\r\n";
  str += "      if( ex < 0 ){ex = 0;}\r\n";
  str += "      else if(ex>c_w){ex = c_w;}\r\n";
  str += "      var e_cl_X = Math.floor(ex);\r\n";
  str += "      ctx2.clearRect(0, 0, c_w, c_h);\r\n";
  str += "      ctx2.beginPath();\r\n";
  str += "      ctx2.fillStyle = '" + fill_col + "';\r\n";
  str += "      ctx2.rect(0,0, e_cl_X, c_h);\r\n";
  str += "      ctx2.fill();\r\n";
  str += "      ctx2.beginPath();\r\n";
  str += "      ctx2.lineWidth = line_width;\r\n";
  str += "      ctx2.strokeStyle = '" + frame_col + "';\r\n";
  str += "      ctx2.strokeRect(0,0,c_w,c_h);\r\n";
  str += "      doSend(String(e_cl_X), '" + slider_id + "');\r\n";
  str += "    };\r\n";
  str += "  };\r\n";
  str += "</script>\r\n";
  return str;
}

String ESP32_SPIFFS_EasyWebSocket::EWS_TextBox_Send(String id, String txt, String BT_txt)
{
  String str;
  str = "<form>\r\n";
  str += "<input type='text' id='" + id + "' value='" + txt + "'>\r\n";
  str += "<input type='button' value='" + BT_txt + "' onclick='doSend_TextBox(\"" + id + "\");'>\r\n";
  str += "</form>\r\n";
  return str;
}

bool ESP32_SPIFFS_EasyWebSocket::HTTP_SPIFFS_Pic_Send(const char* Serv, const char* dir)
{
  String req = "";
  uint8_t b;
  uint8_t data_len;
  uint8_t mask[4];
  uint16_t i;
  uint32_t iii;
  String cut_str = " HTTP/1.1";
  bool ret_send = false;

  if(!_WS_on){
    handleClient();
  }

  while(__client){
    if(__client.available()){
      b = __client.read();
      if(b == B10000001 || b == B10000010 || b == B10001010 || b == B10001000){
        //B10000001 Text frame
        //B10000010 Binary frame
        //B10001010 Pong frame
        switch (b){
          case B10000001:
            Serial.println(F("WebSocket Text Receive*********"));
            _PingLastTime = millis();
            _PongLastTime = millis();
            break;
          case B10000010:
            Serial.println(F("WebSocket Binary Receive*********"));
            _PingLastTime = millis();
            _PongLastTime = millis();
            break;
          case B10001010:
            _PongLastTime = millis();
            Serial.println(F("Pong Receive**********"));
            break;
          case B10001000:
            Serial.println(F("----------------HTTP_SPIFFS_Pic_Send Close Command Received"));
            _PingLastTime = millis();
            _PongLastTime = millis();
            break;
        }

        b = __client.read();
        if(b >= B10000000){
          Serial.println(F("Mask Bit Received--------"));
        }else{
          Serial.println(F("UnMask Bit Received-------"));
        }
        data_len = b - B10000000;
        Serial.print(F("data_len =" ));
        Serial.println(data_len);

        for(i=0; i<4; i++){
          mask[i] = __client.read();
        }

        uint8_t mbit;
        uint8_t maskP;

        iii = 0;
        for(iii = 0; iii<data_len; iii++){
          maskP = iii%4;
          mbit = mask[maskP]^__client.read();
          if(iii>1){
            Serial.write(mbit);
          }
					yield();
        }
        Serial.println(F("----Closing Message"));
        Serial.println();
        while(__client.available()){
          Serial.println(__client.read());
					yield();
        }

        __client.flush();
        delay(10);
        __client.stop();
        delay(10);
        Serial.println();
        Serial.println(F("------------------Client.STOP"));

        _WS_on = 0;
        _Ini_html_on = 0;
        _Upgrade_first_on = false;
      }

