mgo-tec/ESP32_SPIFFS_EasyWebSocket/src/ESP32_SPIFFS_EasyWebSocket.cpp
      while(__client){
        if(__client.available()){
          req = __client.readStringUntil('\n');
          if(req != "") Serial.println(req);
          if(req.indexOf(dir) > 0){
            Serial.println(req);
            String file_path = req.substring(req.indexOf(dir), req.indexOf(cut_str));
            while(__client.available()){
              Serial.write(__client.read());
							delay(1);
            }
            Serial.print(F("--------------")); Serial.print(file_path); Serial.println(F(" open & send\n"));

            req = "";

            __client.print(F("HTTP/1.1 200 OK\r\nContent-Type: image/jpeg\r\n"));
            __client.print(F("Connection:close\r\n\r\n"));
            File jpeg_F = SPIFFS.open(file_path, FILE_READ);
            //size_t totalSize = jpeg_F.size();

            char* c_fpath = 0;
            file_path.toCharArray(c_fpath, file_path.length());

            ESP32_SPIFFS_EasyWebSocket::SPIFFS_Client_Write(jpeg_F, c_fpath);

            jpeg_F.close();

            __client.flush();
            delay(10);
            __client.stop();
            delay(10);
            Serial.println(F("\n--------------------GET JPEG HTTP client stop"));
            req = "";
            file_path = "";
            _WS_on = 0;
            _Ini_html_on = 0;
            _Upgrade_first_on = false;
            return true;
          }
        }
				yield();
      }
    }
		yield();
  }
  return ret_send;
}
void ESP32_SPIFFS_EasyWebSocket::Favicon_Response(String str, uint8_t ws, uint8_t ini_htm, uint8_t up_f)
{
  Serial.println(F("-----------------------Favicon GET Request Received"));
  Serial.println(str);
  while(__client.available()){
    Serial.write(__client.read());
		yield();
  }
  delay(1);

  __client.print(F("HTTP/1.1 404 Not Found\r\n"));
  __client.print(F("Connection:close\r\n\r\n"));

  __client.flush();
  delay(10);
  __client.stop();
  delay(10);

  Serial.println(F("-----------------Client.stop (by Favicon Request)"));

  switch(ws){
    case 1:
      _WS_on = 1;
      break;
    case 2:
      _WS_on = 0;
      break;
  }
  switch(ini_htm){
    case 1:
      _Ini_html_on = 1;
      break;
    case 2:
      _Ini_html_on = 0;
      break;
  }
  switch(up_f){
    case 1:
      _Upgrade_first_on = true;
      break;
    case 2:
      _Upgrade_first_on = false;
      break;
  }
}
//************** mbedtls sha1 *****************************************
void ESP32_SPIFFS_EasyWebSocket::sha1( String str_data, uint8_t hash[20] ){
  mbedtls_sha1_context ctx;
  uint8_t *data = (uint8_t *)str_data.c_str();

  mbedtls_sha1_starts(&ctx);
  mbedtls_sha1_update(&ctx, data, str_data.length());
  mbedtls_sha1_finish(&ctx, hash);
}
//*****************************************
uint8_t ESP32_SPIFFS_EasyWebSocket::WebSocket_Status(){
  return _WS_on;
}
//**************************************************************
String ESP32_SPIFFS_EasyWebSocket::Color_Picker(uint16_t top_px, uint16_t left_px, String default_col, String ID){
  String str = "";

  str += "<div style='position: relative; top:";
  str += String(top_px);
  str += "px; left:";
  str += String(left_px);
  str += "px; width:50px; height:0px'>\r\n";
  str += "<input type='color' value='" + default_col + "' id='" + ID +"' ";
  str += "onchange='Color_Picker_Send(100, \"" + ID + "\", this.value);'>\r\n";
  str += "</div>\r\n";

  return str;
}